tap "bazelbuild/tap"
tap "hashicorp/tap"
tap "quarkdown-labs/quarkdown"
tap "sst/tap"
brew "xz"
brew "glib"
brew "cairo"
brew "harfbuzz"
brew "apache-spark"
brew "openssl@3"
brew "automake"
brew "awscli"
brew "bison"
brew "boost"
brew "chruby"
brew "cmake"
brew "libyaml"
brew "cocoapods"
brew "gmp"
brew "coreutils"
brew "emacs"
brew "gcc"
brew "gemini-cli"
brew "gh"
brew "gnupg"
brew "gradle"
brew "haproxy"
brew "hugo"
brew "iproute2mac"
brew "john"
brew "jq"
brew "kdoctor"
brew "kotlin"
brew "libffi"
brew "libomp"
brew "maven"
brew "neofetch"
brew "neovim"
brew "nmap"
brew "open-mpi"
brew "openjdk@11"
brew "openssl@1.1"
brew "pandoc"
brew "php"
brew "pkgconf"
brew "pyenv"
brew "python@3.10"
brew "python@3.12"
brew "qemu"
brew "rbenv"
brew "ripgrep"
brew "ruby-install"
brew "rust"
brew "sbt"
brew "scala"
brew "spark"
brew "stow"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "wireshark"
brew "yarn"
brew "zlib"
brew "quarkdown-labs/quarkdown/quarkdown"
brew "sst/tap/opencode"
cask "font-jetbrains-mono-nerd-font"
cask "hashicorp/tap/hashicorp-vagrant"
vscode "1yib.rust-bundle"
vscode "42crunch.vscode-openapi"
vscode "74th.monokai-charcoal-high-contrast"
vscode "alexanderte.dainty-nord-vscode"
vscode "anan.jetbrains-darcula-theme"
vscode "astro-build.astro-vscode"
vscode "bmewburn.vscode-intelephense-client"
vscode "cschlosser.doxdocgen"
vscode "dbaeumer.vscode-eslint"
vscode "devsense.composer-php-vscode"
vscode "devsense.intelli-php-vscode"
vscode "devsense.phptools-vscode"
vscode "devsense.profiler-php-vscode"
vscode "dfarley1.file-picker"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "dsznajder.es7-react-js-snippets"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "ginfuru.ginfuru-vscode-jekyll-syntax"
vscode "github.codespaces"
vscode "github.github-vscode-theme"
vscode "golang.go"
vscode "google.geminicodeassist"
vscode "grammarcraft.xtext-lang"
vscode "jeff-hykin.better-cpp-syntax"
vscode "k3a.theme-dark-plus-contrast"
vscode "kamen.noctis-high-contrast"
vscode "kargware.vscode-extension-jekyll-kw"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-ceintl.vscode-language-pack-it"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.mono-debug"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-serial-monitor"
vscode "ms-vscode.vscode-typescript-next"
vscode "neoproxy.dark-modern-tokyo-night"
vscode "otovo-oss.htmx-tags"
vscode "pkief.material-icon-theme"
vscode "quarkdown.quarkdown-vscode"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "sissel.shopify-liquid"
vscode "sldobri.darcula-5-stars"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "vadimcn.vscode-lldb"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "zhuangtongfa.material-theme"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
